Revit API Introduction Labs
Lab3_4_ChangeSelectedInstanceType Class
 Form-based utility to change the type or symbol of a selected standard instance.
 In this section, we change the type of a standard family instance element. We make use of a windows form that displays all available families and types for the category of the single selected instance. Since the lab involves some user interface elements, it may take too long for a hands-on lab. If so, compile and debug the solved lab and discuss the code and its comments with the instructor and your peers. If you are confident with windows forms development, you may try to design similar code in your own project as well. The relevant code in the command does three things:
Ensure a single instance element is selected and determine its category.
Collect all types applicable to this category and sort them into a dictionary mapping the family name to a list of its types.
Display the form, allow the user to select a family and a type, and assign this type to the instance.
 Before proceeding with the selected instance change, we need to ensure that only a single element is selected. We also need to ensure that the element is of FamilyInstance type.
 To create the dictionary of relevant families with a list of all the symbols of each, we can use the new filtering mechanism to create a type filter (of Family type). With this set of family elements, we will match the category of the family (or the symbol, as the case might be) with that of the selected family instance element. It is a good practice to check for category match against category id or built-in category instead of category name.
Displaying the form and assigning the selected type is short and sweet.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_4_ChangeSelectedInstanceType : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_4_ChangeSelectedInstanceType _
	Implements IExternalCommand
Visual C++
public ref class Lab3_4_ChangeSelectedInstanceType : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_4_ChangeSelectedInstanceType
See Also
Lab3_4_ChangeSelectedInstanceType Members
Labs Namespace